# Taps (deprecated taps removed as they're no longer needed)

# Binaries
brew "bat"
brew "btop"                # Modern htop replacement
brew "cheat"
brew "curl"
brew "delta"               # Better git diff viewer
brew "direnv"              # Environment variables per project
brew "dockutil"
brew "dust"                # Modern du replacement
brew "eza"
brew "fd"
brew "fzf"                 # Fuzzy finder
brew "gh"
brew "git"
brew "glow"                # Markdown viewer
brew "htop"
brew "hyperfine"           # Command benchmarking
brew "jq"
brew "just"                # Modern make replacement
brew "lazygit"             # Git TUI
brew "navi"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "vim"
brew "wget"
brew "zoxide"              # Smart cd replacement
brew "zsh"
brew "zsh-autosuggestions"       # Fish-like inline suggestions
brew "zsh-syntax-highlighting"   # Command syntax coloring

# Applications
cask "betterdisplay"
cask "chatgpt"
cask "discord"
cask "docker-desktop"
cask "ghostty"
cask "logi-options-plus"
cask "plex"
cask "proton-mail"
cask "proton-pass"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
cask "zen-browser"
