# Taps (deprecated taps removed as they're no longer needed)

# Binaries
brew "zsh"
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "neofetch"
brew "jq"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "tmux"
brew "vim"
brew "neovim"
brew "fzf"
brew "gh"
brew "starship"
brew "tldr"
brew "dockutil"
brew "topgrade"

# Applications
cask "betterdisplay"
cask "chatgpt"
cask "discord"
cask "docker-desktop"
cask "ghostty"
cask "hoppscotch"
cask "logi-options-plus"
cask "plex"
cask "proton-mail"
cask "proton-pass"
cask "spotify"
cask "visual-studio-code"
cask "zed"
cask "zen-browser"
